In [2]:
d = {'one':[1,1,1,1,1],
      'two':[2,2,2,2,2],
    'letter':['a','a','b','b','c']}

In [4]:
import pandas as pd

df=pd.DataFrame(d)

  letter  one  two
0      a    1    2
1      a    1    2
2      b    1    2
3      b    1    2
4      c    1    2

In [5]:
one =df.groupby('letter')

In [6]:
g=one.sum()
g

        one  two
letter
a         2    4
b         2    4
c         1    2

In [7]:
letterone=df.groupby(['letter','one']).sum()
letterone

            two
letter one
a      1      4
b      1      4
c      1      2

In [9]:
letterone.index

MultiIndex(levels=[['a', 'b', 'c'], [1]],
           labels=[[0, 1, 2], [0, 0, 0]],
           names=['letter', 'one'])

In [ ]:
letterone=df.groupby(['letter','one'], as_index=False).sum()
letterone.index

In [ ]:
letterone.index

Lesson 7

In [ ]:
a=1

a

In [ ]:
a